[{"id":"10001","name":"Python从入门到精通","auther":"Eric Matthes","type":"Python程序设计","image":"http://49.234.211.136:8080/images/10001.png","coordinateX":"1","coordinateY":"2","coordinateZ":"3","breifIntroduction":"本书旨在让你成为优秀的程序员，具体地说，是优秀的Python程序员。通过阅读本书，你将迅速掌握编程概念，打下坚实的基础，并养成良好的习惯。阅读本书后，你就可以开始学习Python高级技术，并能够更轻松地掌握其他编程语言。你将学习获取用户输入，让程序能够与用户交互，并在用户没停止输入时保持运行状态。你将探索如何编写函数来让程序的各个部分可重用，这样你编写执行特定任务的代码后，想使用它多少次都可以。然后，你将学习使用类来扩展这种概念以实现更复杂的行为，从而让非常简单的程序也能处理各种不同的情形。你将学习编写妥善处理常见错误的程序。学习这些基本概念后，你就能编写一些简短的程序来解决一些明确的问题。最后，你将向中级编程迈出第一步，学习如何为代码编写测试，以便在进一步改进程序时不用担心可能引入bug。"},{"id":"10002","name":"Python深度学习","auther":"弗朗索瓦·肖莱","type":"深度学习","image":"http://49.234.211.136:8080/images/10002.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"你拿起这本书的时候，可能已经知道深度学习近年来在人工智能领域所取得的非凡进展。在图像识别和语音转录的任务上，五年前的模型还几乎无法使用，如今的模型的表现已经超越了人类。这种突飞猛进的影响几乎蔓延到所有行业。但是，想要将深度学习技术部署到它能解决的所有问题上，就需要让尽可能多的人接触这门技术，其中包括非专家，即既不是研究人员也不是研究生的那些人。想要让深度学习充分发挥其全部潜能，就需要彻底推广给大众。2015年3月，我发布了Keras深度学习框架的第一版，当时还没有想过人工智能的大众化。我在机器学习领域已经做了多年的研究，创造Keras是为了帮我自己做实验。但在2015—2016年，数万名新人进入了深度学习领域，其中很多人都选择了Keras，因为它是最容易上手的框架(现在仍然是)。看到大量新人以意想不到的强大方式使用Keras，我开始密切关注人工智能的可达性和大众化。我意识到，这些技术传播得越广，就会变得越有用、越有价值。可达性很快成为Keras开发过程中的一个明确目标，在短短几年内，Keras开发者社区已经在这方面取得了了不起的成就。我们让数万人掌握了深度学习，他们反过来用这些技术来解决那些重要的问题，而我们是最近才知道这些问题的。你手里拿的这本书，也是为了让尽可能多的人能够使用深度学习而写的。Keras一直需要一个配套教程，同时涵盖深度学习的基础知识、Keras使用模式以及深度学习的最佳实践。本书是我尽最大努力制作的这么一本教程。本书的重点是用尽可能容易理解的方式来介绍深度学习背后的概念及其实现。我这么做没有贬低任何事情的意思，我坚信深度学习中没有难以理解的东西。希望本书对你有价值，能够帮助构建智能应用程序并解决那些对你很重要的问题。"},{"id":"10003","name":"程序是怎样跑起来的","auther":"矢泽久雄","type":"计算机基础知识","image":"http://49.234.211.136:8080/images/10003.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书的目的是想让诸位了解有关计算机技术的知识范围，掌握其基础中的基础知识，设定目标;同时又想让那些打算用计算机做点什么，却又因难以下手而犹豫不决的人，以及虽然就职于计算机行业，却又因追赶不上最新技术而苦恼的人，能够了解计算机的本质。其实计算机非常简单，谁都能掌握。只要掌握了，计算机就会越来越有趣。其原因在于，从可以轻松买到最初的8比特微型计算机的那个时候开始，我们就幸运地接触到了计算机。面对为数不多的技术，我们可以从容地把时间花在学习计算机的基础知识上。而这些基础知识，即使到了今天也完全没有变化。因此，即便面对的是复杂的最新技术，一旦把它们回归到计算机的基础知识上，就变得可以轻松理解了。就算是和年轻的工程师们阅读同样的技术手册，我们领会其中的要点、抓住其本质的速度也要快得多。"},{"id":"10004","name":"GitHub入门与实践","auther":"大塚弘记","type":"GitHub","image":"http://49.234.211.136:8080/images/10004.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"“开源”一词在我国IT界已经出现了不少年头，但“社会化编程”想必没有多少人接触过。于是在阅读正文之前，容我越俎代庖替作者问一个问题:各位在狭小的空间里呆上一段时间之后，再出门时是否有一种豁然开朗的感觉?相信很多人的答案都是肯定的。对于对日外包出身的我来说，“社会化编程”就给了我这种感觉。或许外包行业在IT界只是极端个例，但“让全世界码农看自己的代码”这种事，很多人恐怕想都不敢想吧。《GitHub入门与实践》是国内比较少见的对GitHub及社会化编程进行系统介绍的书籍。以往我们对于这方面知识，只能通过网络上零零散散的博客或技术文档进行片面了解，难以把握其全貌。各位读完这本书后相信能得到不少帮助。"},{"id":"10005","name":"SQL必知必会","auther":"Ben SQL","type":"计算机基础知识","image":"http://49.234.211.136:8080/images/10005.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"SQL是使用最为广泛的数据库语言。不管你是应用开发者、数据库管理员、Web应用设计师、移动应用开发人员，还是只使用MicrosoftOffice，掌握良好的SQL知识对用好数据库都是很重要的。本书可以说是应需而生。我讲授了多年的Web应用开发，学生们经常要求我推荐一些SQL图书。SQL方面的书很多，有的其实很不错，但它们都有一个共同的特点，就是讲授的内容太多了，多数人其实不需要了解那么多。很多图书讲的不是SQL本身，而是从数据库设计、规范化到关系数据库理论以及管理问题等，事无巨细都讲一通。当然，这些内容也很重要，但大多数读者仅想学习SQL，他们未必感兴趣。"},{"id":"10006","name":"机器学习与优化","auther":"罗伯托·巴蒂蒂","type":"机器学习","image":"http://49.234.211.136:8080/images/10006.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"机器学习与智能优化(learningandintelligentoptimization，LION)结合了学习和优化，它从数据中学习，又将优化用于解决复杂的、动态的问题。LION方法提高了自动化水平，并将数据与决策、行动直接联系起来。描述性分析和预测性分析之后，LION的第三阶段(也是最终阶段)是规范性分析(prescriptiveanalysis)。在自助服务的方式中，决策者手中直接握有更多的权力，而不必求助于中间层的数据科学家。就像汽车的发动机一样，LION包含一系列复杂的机制，但是用户(司机)并不需要知道发动机的内部工作原理，就可以享用它带来的巨大好处。在未来的几十年内，LION方法带来的创新，将会像野火那样，以燎原之势延伸到大多数行业。那么企业就像野火频发的生态系统中的植物一样，只有适应并拥抱LION技术才能生存下来，并繁荣昌盛;否则，无论之前如何兴盛，在竞争逐渐加剧的挑战面前，都可能土崩瓦解。"},{"id":"10007","name":"白话机器学习算法","auther":"黄莉婷 苏川集","type":"机器学习","image":"http://49.234.211.136:8080/images/10007.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"两位作者本来可以在书中讲解各种数据科学概念，而且讲解方法也有很多。但是，他们特意把讲解重点放在了对数据科学极其重要的机器学习算法上，并辅以相应的任务场景，这真是明智之举。k均值聚类、决策树、最近邻等算法得到了应有的重视。此外，两位作者还对高级的分类和集成算法(比如支持向量机，它常常因为复杂的数学问题而令人生畏)以及随机森林做了讲解。当然，书中还讲了神经网络，它是当前的深度学习热潮背后的驱动力。本书的另一个优点是，每个算法的讲解都配有直观的示例，比如通过预测犯罪行为介绍随机森林，以及在分析影迷性格特征时讲聚类。这些示例都是作者精心挑选的，有助于理解相关算法。与此同时，讲解并没有涉及高等数学知识，这样做有利于保持你对数据科学的兴趣和学习动力。"},{"id":"10008","name":"Feature Engineering for Machine Learning","auther":"Alice Zheng & Amanda Casari","type":"机器学习","image":"http://49.234.211.136:8080/images/10008.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"Machine learning fits mathematical models to data in order to derive insights or make predictions. These models take features as input. A feature is a numeric repre‐ sentation of an aspect of raw data. Features sit between data and models in the machine learning pipeline. Feature engineering is the act of extracting features from raw data and transforming them into formats that are suitable for the machine learn‐ ing model. It is a crucial step in the machine learning pipeline, because the right fea‐ tures can ease the difficulty of modeling, and therefore enable the pipeline to output results of higher quality. Practitioners agree that the vast majority of time in building a machine learning pipeline is spent on feature engineering and data cleaning. Yet, despite its importance, the topic is rarely discussed on its own. Perhaps this is because the right features can only be defined in the context of both the model and the data; since data and models are so diverse, it’s difficult to generalize the practice of feature engineering across projects.Nevertheless, feature engineering is not just an ad hoc practice. There are deeper principles at work, and they are best illustrated in situ. Each chapter of this book addresses one data problem: how to represent text data or image data, how to reduce the dimensionality of autogenerated features, when and how to normalize, etc. Think of this as a collection of interconnected short stories, as opposed to a single long novel. Each chapter provides a vignette into the vast array of existing feature engi‐ neering techniques. Together, they illustrate the overarching principles."},{"id":"10009","name":"我的第一本算法书","auther":"石田保辉 宫崎修一","type":"算法","image":"http://49.234.211.136:8080/images/10009.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书以iOS和Android平台上的应用程序“算法动画图解”为基础，以图配文，详细讲解了各种算法和数据结构的基本原理。如果本书能够帮助大家理解基本算法的操作和特征，那么我将感到十分荣幸。使用不同的算法解决同一个问题时，就算得到的结果是一样的，算法之间的性质也有很大的差异。比如，某个算法的运行时间很短，但需要占用大量内存;而另一个算法运行时间较长，但内存资源占用较少。学习各种算法可以使我们在编程时有更多的选择。成为优秀程序员的必要条件之一，就是可以根据应用场景选择最合适的算法。如果您对算法有兴趣，还可以挑战一下“算法理论”这门学科，试着去发现更高效的算法，或者研究目前用算法还无法解决的问题。"},{"id":"10010","name":"推荐系统实践","auther":"项亮","type":"推荐系统实践","image":"http://49.234.211.136:8080/images/10010.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"推荐在今天互联网的产品和应用中被广泛采用，包括今天大家经常使用的相关搜索、话题推荐、电子商务的各种产品推荐、社交网络上的交友推荐等。但是，至今还没有一本书从理论上对它进行系统地分析和论述。《推荐系统实践》这本书恰恰弥补了这个空白。该书总结了当今互联网主要领域、主要公司、各种和推荐有关的产品和服务，包括:亚马逊的个性化产品推荐;Netflix的视频和DVD推荐;Pandora的音乐推荐;Facebook的好友推荐;GoogleReader的个性化阅读;各种个性化广告。书的名称虽然是《推荐系统实践》，但作者也阐述了和推荐系统有关的理论基础和评价推荐系统优劣的各种标准与方法，比如覆盖率、满意度、AB测试等。由于这些评估很大程度上取决于对用户行为的分析，因此本书也介绍了用户行为分析方法，并且给出了计算机实现的算法。本书对有兴趣自己开发推荐系统的读者给出了设计和实现推荐系统的方法与技巧，非常具有指导意义。本书文笔流畅，可读性较高，是一部值得推荐给IT从业人员的优秀参考书。"},{"id":"10011","name":"程序员的算法趣题","auther":"增井敏克c","type":"算法","image":"http://49.234.211.136:8080/images/10011.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书是一本解谜式的趣味算法书，从实际应用出发，通过趣味谜题的解谜过程，引导读者在愉悦中提升思维能力、掌握算法精髓。此外，本书作者在谜题解答上，通过算法的关键原理讲解，从思维细节入手，发掘启发性算法新解，并辅以Ruby、JavaScript等不同语言编写的源代码示例，使读者在算法思维与编程实践的分合之间，切实提高编程能力。本书适合已经学习过排序、搜索等知名算法，并想要学习更多有趣算法以提升编程技巧、拓展程序设计思路的程序员，以及对挑战算法问题感兴趣、爱好解谜的程序员阅读。关于本书，最推荐的阅读方式是读完题先停下来想想解法。此时最好能打开电脑，打开编辑器，先试着把题做出来。做完之后再往下读，顺着作者的分析和解答细细体会问题背后的算法思路。书中每一个问题都汇集了作者以及CodeIQ网站大量用户的集体智慧，相信做完题再作对比，一定可以收获不少新的体会。如果您发现了更好的解法，希望您可以到图灵社区(http://www.ituring.com.cn/)或者本书的代码仓库(https://github.com/leungwensen/70-math-quizs-for-programmers)上和大家分享交流，共同进步。"},{"id":"10012","name":"Linux命令行与shell脚本编程大全","auther":"Richard Blum & Christine Bresnahan","type":"Linux","image":"http://49.234.211.136:8080/images/10012.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"如果你是Linux环境下的系统管理员，那么学会编写shell脚本将让你受益匪浅。本书并未细述安装Linux系统的每个步骤，但只要系统已安装好Linux并能运行起来，你就可以开始考虑如何让一些日常的系统管理任务实现自动化。这时shell脚本编程就能发挥作用了，这也正是本书的作用所在。本书将演示如何使用shell脚本来自动处理系统管理任务，包括从监测系统统计数据和数据文件到为你的老板生成报表。如果你是家用Linux爱好者，同样能从本书中获益。现今，用户很容易在诸多部件堆积而成的图形环境中迷失。大多数桌面Linux发行版都尽量向一般用户隐藏系统的内部细节。但有时你确实需要知道内部发生了什么。本书将告诉你如何启动Linux命令行以及接下来要做什么。通常，9如果是执行一些简单任务(比如文件管理)，在命令行下操作要比在华丽的图形界面下方便得多。在命令行下有大量的命令可供使用，本书将会展示如何使用它们。"},{"id":"10013","name":"精通Linux","auther":"Brian Ward","type":"Linux","image":"http://49.234.211.136:8080/images/10013.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"之所以写这本书，是因为我觉得你应该对你使用的计算机有所了解。你应该可以让软件去做你想让它去做的事(当然要在它的能力范围之内)。要做到这一点，关键是必须理解软件能做什么，以及是怎么做的。这些正是本书要介绍的内容。这样你就不必对着计算机抓狂了。如果你要学习这方面的知识，Linux是一个很好的平台，因为它是一个透明的系统。特别是大多数系统配置都存放在文本文件中，让人一目了然。难点在于了解每个组件分别负责什么，以及它们如何协同工作。我们学习Linux的原因可能各不相同。对于IT从业者(如系统运维人员)来说，他们需要了解本书中的几乎所有内容。对于Linux软件架构师和开发人员来说，他们同样需要了解这些内容，以便发挥操作系统的最大功效。对于只需考虑个人所用Linux系统的研究人员和学生来说，本书能够让他们理解为什么系统是那个样子的。还有一些堪称多面手的读者，出于兴趣、谋利或其他原因而摆弄计算机，喜欢探究事情的根源，喜欢尝试不同的可能性。或许你就是其中一位。"},{"id":"10014","name":"深入Linux内核架构","auther":"Wolfgang Mauerer","type":"Linux","image":"http://49.234.211.136:8080/images/10014.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书讨论了Linux内核的概念、结构和实现。主要内容包括多任务、调度和进程管理，物理内存的管理以及内核与相关硬件的交互，用户空间的进程如何访问虚拟内存，如何编写设备驱动程序，模块机制以及虚拟文件系统，Ext文件系统属性和访问控制表的实现方式，内核中网络的实现，系统调用的实现方式，内核对时间相关功能的处理，页面回收和页交换的相关机制以及审计的实现等。此外，本书借助内核源代码中最关键的部分进行讲解，帮助读者掌握重要的知识点，从而在运用中充分展现Linux系统的魅力。本书适合Linux内核爱好者阅读。本书可用作指南和手册，引导读者阅读内核源代码，并使得读者能够更敏锐地体会到这些代码的美丽、优雅，以及相关概念在设计上的美学取向。当然，要理解内核，是有一些前提条件的。读者必17须熟悉C语言。如果对您来说C只是一个字母，或者是一门外语，那可以休矣。操作系统绝非仅仅是一个“开始”按钮，熟悉少量相关的算法绝对是有益无害的。最后，如果读者对计算机体系结构有一定的了解，而不是仅仅知道如何造一个新奇的机箱，那就更有用了。从学术观点来看，上述要求比较接近于系统程序设计、算法和操作系统原理课程。本书的前一版本已经在几所大学用于向高年级本科生讲授Linux原理，我希望这一版也能用于同样的目的。"},{"id":"10015","name":"计算进化史：改变数学的命运","auther":"吉尔·多威客","type":"计算机基础知识","image":"http://49.234.211.136:8080/images/10015.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"说起数学史，也许你会想到课本里各种定理前耳熟能详的名字，他们是代表人类最高智慧的璀璨群星。数学家们提出的定理，以及这些定理的证明，构成了数学史上一个又一个里程碑。然而，在浩如烟海的数学史中，本书作者却独辟蹊径，挑出了一条似乎并不那么耀眼的主线——计算。“计算”这条主线看似简单，却牵涉到了哲学、逻辑、语言学、计算机科学等诸多领域。对于这些有些抽象乃至艰涩的内容，作者用通俗易懂的语言，清晰地把握概念而不过多地涉及学术细节，在必要处又用简明的算法示例与生动的故事加以介绍，充分展现了“大家写小书”的风范。在如今这个时代，计算机科学，特别是算法逐渐占据了我们的工作和生活每一个角落，对“计算”本身多一些了解和思考，应该说是十分有益甚至必要的。也许这本书中提到的某个领域，能够激起读者的兴趣，引发进一步的探索和研究呢。"},{"id":"10016","name":"别拿关系当因果！因果关系简易入门","auther":"萨曼莎·克莱因伯格","type":"计算机基础知识","image":"http://49.234.211.136:8080/images/10016.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书是写给普通人的因果逻辑入门书，旨在帮助读者培养严谨的思维方式，在不借助任何专业知识的前提下，准确定位问题。主要内容包括:认识原因，对原因的理解和运用，如何只通过观察找到原因，大数据集与原因的关系，因果关系相关实验，如何利用因果关系来制定有效的干预措施，研究因果关系的意义。本书适合所有对探究事件真相感兴趣的读者，无须统计学等专业背景。尽管用先进的计算工具很容易从数据中找到规律，但是最深刻的认识还是来自于对这些规律来源的把握，而这可不能只通过计算机来完成。克莱因伯格巧妙地向读者介绍了寻找因果关系过程中所用到的主要概念和方法，思路清晰且内容实用，使得这本书不同于这一领域的其他著作。书中内容全面又易于理解，是科研领域的新人、经验丰富的专家以及其他想要从数据中获取更多认知的读者的必读之物。"},{"id":"10017","name":"邀你共进量子早餐","auther":"索尼娅·费尔南德斯·比达尔","type":"计算机基础知识","image":"http://49.234.211.136:8080/images/10017.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书打破了时间与空间的束缚，以生动有趣的语言讲述了量子力学的基本概念以及量子力学发展史。读者将同主人公一起，搭乘时间机器回到现代物理诞生之前的世界，跟随量子仙女的脚步造访薛定谔的猫的故乡，与量子学派的代表人物共进早餐，并光临欧洲核子研究组织了解关于量子技术的新研究，切身感受与日常生活息息相关的量子物理的奇妙之处。本书适合对量子物理感兴趣的读者阅读，无须过多物理基础。这是一家量子力学的主题餐厅，大门和阿加德米学园十分相似，只是门楣上写的不是“非几何学家不得入内”，而是“要想学习好，量子早餐要吃饱”。餐厅内部装饰考究，大大的背景墙上布满了明暗交替的条纹，据说这就是当年托马斯·杨做双缝实验时使用的大屏幕。仔细聆听，背景音乐播放的正是多维世界中最流行的宇宙交响曲，天籁之音，舒缓而圆润。环顾四周，身边的客人不是在谈论爱因斯坦的奇迹年、普朗克常数，就是在聊海森堡、费曼等科学家的轶事。"},{"id":"10018","name":"Operating Syste Concepts","auther":"Yale University","type":"操作系统","image":"http://49.234.211.136:8080/images/10018.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"Operating systems are an essential part of any computer system. Similarly, a course on operating systems is an essential part of any computer science edu- cation. This field is undergoing rapid change, as computers are now prevalent in virtually every arena of day-to-day life—from embedded devices in auto- mobiles through the most sophisticated planning tools for governments and multinational firms. Yet the fundamental concepts remain fairly clear, and it is on these that we base this book.We wrote this book as a text for an introductory course in operating sys- tems at the junior or senior undergraduate level or at the first-year graduate level. We hope that practitioners will also find it useful. It provides a clear description of the concepts that underlie operating systems. As prerequisites, we assume that the reader is familiar with basic data structures, computer organization, and a high-level language, such as C or Java. The hardware topics required for an understanding of operating systems are covered in Chapter 1. In that chapter, we also include an overview of the fundamental data structures that are prevalent in most operating systems. For code examples, we use pre- dominantly C, as well as a significant amount of Java, but the reader can still understand the algorithms without a thorough knowledge of these languages."},{"id":"10019","name":"Java轻松学","auther":"Bryson Payne","type":"Java程序设计","image":"http://49.234.211.136:8080/images/10019.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书是Java基础教程类图书，通过开发实际的桌面和移动应用，从实战角度指导读者快速上手Java编程。主要内容包括:Java、Eclipse和AndroidStudio的安装与设置，JShell的用法，条件、循环、方法变量、类等Java编程概念，函数创建，GUI构建，代码调试，常见错误的规避。本书适合所有对Java编程感兴趣的初学者。Java被用于全球各地的数十亿台设备中。从移动应用到桌面软件，从最大的企业设备到最小的个人设备，它们背后都是Java在提供动力。学生、IT专业人士以及任何有志于从事编程事业的人都将发现，Java是必须学会的。作为从事了将近20年Java教学的计算机科学教授，我编写本书旨在帮助你像我学习编程时一样，通过开发实际项目来学习Java。我发现，开发有趣、引人入胜且值得分享的实际应用和游戏，是学习编程的最佳方式。在本书中，你将创建简单的猜数游戏、用于与朋友交换消息的SecretMessages应用以及交互式绘图应用BubbleDraw。你不需要有任何编程经验，但如果你学习过其他语言，也可通过这种实践方法更快地掌握Java。"},{"id":"10020","name":"Android编程权威指南（第3版）","auther":"Bill Philips Chris Stewart Kristin Marsicano","type":"Android程序设计","image":"http://49.234.211.136:8080/images/10020.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"BigNerdRanch是美国一家专业的移动开发技术培训机构。本书主要以其Android训练营教学课程为基础，融合了几位作者多年的心得体会，是一本完全面向实战的Android编程权威指南。全书共36章，详细介绍了8个Android应用的开发过程。通过这些精心设计的应用，读者可掌握很多重要的理论知识和开发技巧，获得宝贵的开发经验。第3版较之前版本增加了对数据绑定等新工具的介绍，同时新增了针对单元测试、辅助功能和MVVM架构等主题的章节。如果你熟悉Java语言，或者了解面向对象编程，那就立刻开始Android编程之旅吧!本书将协助你完成以上两件事情。我们已用它成功培训了数千名专业的Android开发人员。本书将指导你完成多个Android应用的开发，并根据需要逐步介绍各种理论概念及技术知识。在学习过程中，如果遇到知识疑难点，请勇敢面对;我们也会尽最大努力抽丝剥茧，让你知其然更知其所以然。"},{"id":"10021","name":"OpenCV计算机视觉编程攻略（第3版）","auther":"Robert Laganière","type":"计算机视觉","image":"http://49.234.211.136:8080/images/10021.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书结合C++和OpenCV全面讲解计算机视觉编程，不仅涵盖计算机视觉和图像处理的基础知识，而且通过完整示例讲解OpenCV的重要类和函数。主要内容包括OpenCV库的安装和部署、图像增强、像素操作、图形分析等各种技术，并且详细介绍了如何处理来自文件或摄像机的视频，以及如何检测和跟踪移动对象。第3版针对OpenCV最新版本进行了修改，调整了很多函数和算法说明，还增加了立体图像深度检测、运动目标跟踪、人脸识别、人脸定位、行人检测等内容，适合计算机视觉新手、专业软件开发人员、学生以及所有想要了解图像处理和计算机视觉技术的人员学习参考。本书全面而系统地介绍了计算机视觉领域最著名的开源程序库——OpenCV。本书不只是简单列出了各种函数和类，而是由浅入深地介绍了OpenCV及有关算法，并通过详细的实用案例，让读者从零开始学习计算机视觉和OpenCV，真正掌握相关程序的开发方法。通过阅读本书，你将了解计算机视觉的基础知识，知道有关算法的来龙去脉，掌握OpenCV的总体架构和常用功能，学会用OpenCV解决具体问题。本书将带你进入图像和视频分析的世界，揭开图像识别、三维重建、目标跟踪、人脸识别等技术的神秘面纱。"},{"id":"10022","name":"Web开发权威指南","auther":"Chris Aquino & Todd Gandee","type":"Web程序设计","image":"http://49.234.211.136:8080/images/10022.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书在知名培训机构BigNerdRanch培训教材的基础上编写而成，囊括了JavaScript、HTML5、CSS3等现代前端开发人员急需的技术关键点，包括响应式UI、访问远程Web服务、用Ember.js构建应用，等等。此外，还会介绍如何使用前沿开发工具来调试和测试代码，并且充分利用Node.js和各种开源的npm模块的强大功能来进行开发。全书分四部分，每部分独立完成一个项目，由浅入深、循序渐进，在构建一系列应用的过程中，介绍Web开发的核心概念和API。无论是否拥有Web开发经验，抑或拥有其他平台的开发背景，只要对当今流行的工具和开发实践充满兴趣，这本书都能让你受益匪浅。你也许在iOS或者Android上进行过原生开发，或者用Ruby、PHP写过服务器端代码，抑或在OSX或者Windows上构建过桌面应用。但作为前端开发者，你的代码则需要面向浏览器——一个几乎存在于全世界所有手机、平板电脑和个人计算机中的平台。"},{"id":"10023","name":"游戏剧本怎么写","auther":"佐佐木智广","type":"游戏编程","image":"http://49.234.211.136:8080/images/10023.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书从人物、世界体系、台词等角度入手，通过解析多部经典游戏、动漫作品的剧本细节，通俗而又系统地讲解了游戏剧本的构建之法，是游戏设计的入门佳作。全书共分为3部分:第1部分主要介绍游戏剧本的主要成分——主题、故事、角色和世界;第2部分详细说明游戏剧本的结构、选项设计等;第3部分总结游戏剧本中文本的写作窍门等。本书结构清晰明了、语言风趣易懂，对小说、动漫、电影等艺术作品的构思创作也有启示。本书适合游戏、动漫领域的从业者和爱好者，以及所有对游戏剧本创作感兴趣的读者阅读。本书主要针对游戏中侧重剧情的文字冒险游戏(AdventureGame，AVG)和角色扮演游戏(RolePlayingGame，RPG)进行讲解，讲解过程中会涉及一些游戏、电影、漫画的内容。虽然笔者在编写时已经尽力让没接触过这些作品的读者也能读懂其中的内容，但是还是希望各位最好在玩过或者看过这些作品的基础上阅读本书。本书选择的都是值得一玩(看)的热门作品，这些作品无一不给笔者带来过很强的创作欲望。"},{"id":"10024","name":"Excel从入门到精通","auther":"文杰书院","type":"Office","image":"http://49.234.211.136:8080/images/10024.png","coordinateX":"0","coordinateY":"0","coordinateZ":"0","breifIntroduction":"本书由国内办公软件专家组织编写，以现代办公工作中广大办公人员和从业者的需求来确定中心思想，采用四维立体教学的方式，精选经典应用实例、标注重点学习内容，使读者能够在较短时间内掌握软件的使用方法和技巧，真正实现“工欲善其事，必先利其器”。全书共分为17章，详细地介绍了：掌握Excel基础知识、输入与管理数据、编辑单元格、编辑工作表、应用公式与函数、数据的浅易分析、使用图表分析数据、使用数据透视表和图分析数据、输出工作表、编辑宏与VBA、管理产品入库情况、财务报表处理、制作人事资料管理系统、管理员工工资、流动资产管理、筹资决策分析、营销决策分析等内容。"}]
